# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Use latest git 
brew 'git'
brew 'python'

brew 'azcopy'
brew 'azure-cli'
brew 'httpie'
brew 'mas' # Mac App Store manager
brew 'svn' # some font casks need this...
brew 'yarn'
brew 'imagemagick'
brew 'pandoc'
brew 'mackup'

brew 'fzf'

# Development
brew 'imagemagick'
brew 'nvm'
brew 'yarn'

# Apps
cask '1password'
cask '1password-cli'
cask 'aerial'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'imageoptim'
cask 'microsoft-edge'
cask 'microsoft-teams'
cask 'notion'
cask 'transmission'
cask 'visual-studio-code'
cask 'zoom'

cask 'hammerspoon'

# Quicklook
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlimagesize'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'

# Fonts
cask 'font-fira-code'
cask 'font-hack'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'

# Mac App Store
mas 'BetterSnapTool', id: 417375580
mas 'Lungo', id: 1263070803
mas 'Microsoft To D‪o', id: 1212616790
mas 'The Unarchive‪r', id: 425424353
mas 'Slack', id: 618783545
mas 'Yoink - Improved Drag and Dro‪p', id: 1260915283
mas '1Password 7 - Password Manage‪r', id: 1333542190