# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
# tap 'homebrew/bundle'
brew tap 'homebrew/brew'

# Use latest git
brew 'git'
brew 'python'

brew 'azcopy'
brew 'azure-cli'
brew 'httpie'
brew 'ipcalc'
brew 'mas' # Mac App Store manager
brew 'svn' # some font casks need this...
brew 'yarn'
brew 'imagemagick'
brew 'pandoc'
brew 'mackup'
brew 'tree'
brew 'thefuck'

brew 'fzf'

# Development
brew 'imagemagick'
brew 'nvm'
brew 'yarn'
brew 'ruby'

# Apps
cask 'aerial'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'imageoptim'
cask 'microsoft-edge'
cask 'notion'
cask 'spotify'
cask 'visual-studio-code'
cask 'zoom'

cask 'hammerspoon'

# Quicklook
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'

# Fonts
cask 'font-fira-code'
cask 'font-hack'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'

# Mac App Store
mas 'Lungo', id: 1263070803
mas 'The Unarchiver', id: 425424353
mas 'Yoink - Improved Drag and Drop', id: 1260915283
