# Use latest git
brew 'git'
brew 'python'

brew 'httpie'
brew 'ipcalc'
brew 'mas' # Mac App Store manager
brew 'svn' # some font casks need this
brew 'yarn'
brew 'imagemagick'
brew 'pandoc'
brew 'tree'
brew 'thefuck'
brew 'fzf'

# Modern CLI tools
brew 'ripgrep'
brew 'fd'
brew 'bat'
brew 'eza'
brew 'zoxide'
brew 'tldr'
brew 'jq'
brew 'starship'

# Development
brew 'nvm'
brew 'ruby'

# Apps
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'imageoptim'
cask 'notion'
cask 'spotify'
cask 'visual-studio-code'
cask 'zoom'
cask 'hammerspoon'

# Fonts
cask 'font-fira-code'
cask 'font-hack'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'

# Mac App Store
mas 'Lungo', id: 1263070803
mas 'The Unarchiver', id: 425424353
mas 'Yoink - Improved Drag and Drop', id: 1260915283
